app/Controllers/Categorias.php

SELECT *
FROM `categorias`
WHERE `activo` = 0
---
    public function eliminados($activo = 0)
    {
        $categorias = $this->categorias->where('activo', $activo)->findAll();