app/Controllers/Compras.php

INSERT INTO `detalle_compra` (`id_compra`, `id_producto`, `nombre`, `cantidad`, `precio`, `fecha_alta`) VALUES (3, '2', 'arroz', '8', '2', '2022-10-08 02:02:36')
---
    public function guarda()
    {
        $id_compra = $this->request->getPost('id_compra');
        $total = $this->request->getPost('total');

        $session = session();

        $resultadoId = $this->compras->insertaCompra($id_compra, $total, $session->id_usuario);

        $this->temporal_compra = new TemporalCompraModel();

        if ($resultadoId) {
            $resultadoCompra = $this->temporal_compra->porCompra($id_compra);

            foreach ($resultadoCompra as $row) {
                $this->detalle_compra->save([
                    'id_compra' => $resultadoId,
                    'id_producto' => $row['id_producto'],
                    'nombre' => $row['nombre'],
                    'cantidad' => $row['cantidad'],
                    'precio' => $row['precio']


                ]);