app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `codigo` = '2'
AND `activo` = 1
---
    public function buscarPorCodigo($codigo)
    {
        $this->productos->select('*');
        $this->productos->where('codigo', $codigo);
        $this->productos->where('activo', 1);
        $datos = $this->productos->get()->getRow();