app/Controllers/Unidades.php

INSERT INTO `unidades` (`nombre`, `nombre_corto`, `fecha_alta`, `fecha_edit`) VALUES ('Estiben', 'es22', '2022-09-03 12:31:49', '2022-09-03 12:31:49')
---
    public function insertar()
    {
        if ($this->request->getMethod() === "post" && $this->validate($this->reglas)) {
            $this->unidades->save(['nombre' => $this->request->getPost('nombre'), 'nombre_corto' => $this->request->getPost('nombre_corto')]);