app/Controllers/Unidades.php

    public function index($activo = 1)
    {
        $unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1

    public function eliminados($activo = 2)
    {
        $unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 2

    public function eliminar($id)
    {

        $this->unidades->update($id, ['activo' => 0]);
---
UPDATE `unidades` SET `activo` = 0, `fecha_edit` = '2022-09-02 03:13:03'
WHERE `unidades`.`id` IN ('2')