app/Controllers/Usuarios.php

    public function index($activo = 1)
    {
        $usuarios = $this->usuarios->where('activo', $activo)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `activo` = 1

    public function valida(){
        if ($this->request->getMethod() === "post" && $this->validate($this->reglasLogin)) {
            $usuario=$this->request->getPost('usuario');
            $password=$this->request->getPost('password');
            $datoUsuario = $this->usuarios->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'admin'
 LIMIT 1

    public function cambia_password()
    {
        $session = session();
        $usuario = $this->usuarios->where('id', $session->id_usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `id` = '5'
 LIMIT 1