app/Models/ComprasModel.php

    public function insertaCompra($id_compra, $total, $id_usuario)
    {
        $this->insert([
            'folio' => $id_compra,
            'total' => $total,
            'id_usuario' => $id_usuario,
        ]);
---
INSERT INTO `compras` (`folio`, `total`, `id_usuario`, `fecha_alta`) VALUES ('6341207f7f517', '16.00', '5', '2022-10-08 02:02:36')