app/Models/ProductosModel.php

UPDATE `productos` SET `existencia` = existencia + 10
WHERE `id` = '2'
---
    public function actualizaStock($id_producto, $cantidad)
    {
        $this->set('existencia', "existencia - $cantidad", FALSE);
        $this->where('id', $id_producto);
        $this->update();